//Да се напише функция на C++, която приема като параметър цяло положително число и връща като резултат сумата от цифрите му.
// Функцията да не извиква други функции.
//Да се напише програма, която извиква написаната функция върху три цели числа
//(едноцифрено, двуцифрено и избрано от вас) и извежда на екрана резултатите за всяко от тях.


#include <iostream>
using namespace std;

int sum (int num)
{
    int sum = 0;

    while (num != 0)
    {
        int rem = num % 10;
        sum += rem;
        num /= 10;
    }
    return sum;
}

int main()
{
    cout << sum(6);
    cout << endl;
    cout << sum(78);

    int num;
    cin >> num;
    cout << sum(num);
    
    return 0;
}